Repository: mozilla-l10n/mt-training-data
Catalog: yua/yua_pontoon.tmx
Source language: en_us
Languages: yua

source: <p>The network link was interrupted while negotiating a connection. Please try again.</p> <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
yua: <p>Le enlace páawo'ob bin interrumpido ka' jo'op' u jump'éel conexión bin u negociada. Beet uts a wilik tu ka'atéen.</p> <ul> <li>Le ts'ono'oto' je'el u páajtal u temporalmente ma' disponible wa jach ocupado. Beet uts a wilik tu ka'atéen ichil wa jayp'éel minutos.</li> <li>Wa ma' tu páajtal a kuuch mix jump'éel linki abas kaambal, ilawil u conexión Wi-Fi wa datos ti' a nu'ukul t'aan.</li> </ul>

source: <p>The page you are trying to view cannot be shown because an error in the data transmission was detected.</p> <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
yua: <p>Ma' tu páajtal u chíikpajal le linki abas kaambal ka k'áat a wile' tumen ts'o'ok u yila'al jump'éel ba'alo'ob ichil u túuxta'al datos.</p> <ul> <li>Béet t'aan yéetel u yuumil le ts'ono'oto' web uti'al a ts'áaik ojéeltbil ti'ob le talamila'.</li> </ul>

source: <p>The page you are trying to view cannot be shown because it uses an invalid or unsupported form of compression.</p> <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
yua: <p>Ma' tu páajtal u ye'esa'al le linki abas kaambal ka k'áat a wile' tumen ku meyajtik jump'éel bix u t'o'oxol ma' jach ma'alob wa ma' tu yáanta'al.</p> <ul> <li>Béet t'aan yéetel u yuumil le ts'ono'oto' web uti'al a ts'áaik ojéeltbil ti'ob le talamila'.</li> </ul>

source: <p>The provided address is not in a recognized format. Please check the location bar for mistakes and try again.</p>
yua: <p>Le dirección ts'a'aba' ma' ti' yaan ti' jump'éel formato reconocido. Ilawil wa mina'an ba'alo'ob ti' le barra direcciones ka ka'a ilawil.</p>

source: <p>The requested address specified a port (e.g., <q>mozilla.org:80</q> for port 80 on mozilla.org) normally used for purposes <em>other</em> than Web browsing. The browser has canceled the request for your protection and security.</p>
yua: <p>Le dirección solicitada especificaba jump'éel puerto (e.g., <q>mozilla.org:80</q> utia'al u puerto 80 ti' mozilla.org) ku meyajtiko'ob típicamente utia'al u propósitos <em>uláak'</em> u navegar ti' Internet . Le navegador ts'o'ok u xu'ulsik le k'áat chi'o' uti'al a kanáanil yéetel a kanáanil.</p>

source: <p>The requested site did not respond to a connection request and the browser has stopped waiting for a reply.</p> <ul> <li>Could the server be experiencing high demand or a temporary outage? Try again later.</li> <li>Are you unable to browse other sites? Check the device’s network connection.</li> <li>Is your device or network protected by a firewall or proxy? Incorrect settings can interfere with Web browsing.</li> <li>Still having trouble? Consult your network administrator or Internet provider for assistance.</li> </ul>
yua: <p>Le kúuchil tu k'áataj ma' tu núukaj jump'éel k'áat chi' ti' conexión yéetel le navegador ts'o'ok u dejado u pa'atik jump'éel núukik.</p> <ul> <li>¿¿Podría estar experimentando le servidor jump'éel alta demanda wa jump'éel corte temporal? Vuelva a intentarlo más tarde.</li> <li>¿Ma' je'el u páajtal u xíimbal ti' uláak' kúuchilo'ob? Compruebe le conexión de rojo del equipo.</li> <li>¿¿Ba'ax le equipo yaan u kanáanta'al tumen juntúul cortafuegos wa juntúul proxy? jump'éel configuración ma' ma'alob je'el u páajtal u interferir ti' le navegación web.</li> <li>¿Aun con problemas? Utia'al u yantal áantaj técnica, k'áatik ti' le administrador ti' internet ichil.</li> </ul>

source: <p>The site at %1$s has been reported as an attack site and has been blocked based on your security preferences.</p>
yua: <p>Le ts'ono'oto' yaan ti' %1$s ts'o'ok u k'ajóolta'al bey jump'éel ts'ono'oto' ku atacar yéetel ts'o'ok u k'a'alal je'el bix a k'áat ti' seguridad.</p>

source: <p>The site at %1$s has been reported as a potentially harmful site and has been blocked based on your security preferences.</p>
yua: <p>Le ts'ono'oto' yaan %1$s ts'o'ok u yila'al bey jump'éel ts'ono'oto' je'el u páajtal u beetik loob yéetel ts'o'ok u k'a'alal je'el bix a k'áat ti' seguridad.</p>

source: <p>The site at %1$s has been reported as serving unwanted software and has been blocked based on your security preferences.</p>
yua: <p>Le ts'ono'oto' yaan %1$s ts'o'ok u k'ajóolta'al bey jump'éel ts'ono'oto' ku k'u'ubul software ma' k'áata'an yéetel ts'o'ok u k'a'alal je'el bix a k'áat ti' seguridad.</p>

source: <p>The site responded to the network request in an unexpected way and the browser cannot continue.</p>
yua: <p>Le ts'ono'oto' tu núukaj le k'áat chi'o' ti' jump'éel bix ma' táan u páa'ta'al yéetel le navegadoro' ma' tu páajtal u bin táanil.</p>

source: <p>This web page at %1$s has been reported as a deceptive site and has been blocked based on your security preferences.</p>
yua: <p>Le linki abas kaambal ti' %1$s ts'o'ok u yila'al bey jump'éel ts'ono'oto' tuus yéetel ts'o'ok u k'a'alal je'el bix a k'áat ti' seguridad.</p>

source: QR scanner
yua: Escáner QR

source: Rating
yua: Náajalil

source: Rating: %1$.02f out of 5
yua: U p'iis: %1$.02f ti' 5

source: Read and modify bookmarks
yua: Xook yéetel k'ex le marcadores

source: Read and modify browser settings
yua: Xook yéetel k'ex u configuración le navegador

source: Read and modify privacy settings
yua: Xook yéetel k'ex le configuración yojeta'al mixba'al

source: Read the text of all open tabs
yua: Xook le analte'o' le k'iino'oba' pestañas abiertas

source: Read your browsing history
yua: Xook u historial u navegación

source: Rear-facing camera
yua: Cámara trasera

source: Recommended
yua: Rekomendarta'an

source: Refresh
yua: Túumbenkuunsik

source: Reload
yua: Ka'a kuuch

source: Remember decision for this site
yua: K'a'ajaktech u jets't'aanil le ts'ono'oto'

source: Reminder: %1$s is still using your camera. Tap to open the tab.
yua: K'a'ajsajil: %1$s láayli' táan u meyajtik a cámarao'. Pulse uti'al u je'ebel le ju'unil tu'ux yaan.

source: Reminder: %1$s is still using your microphone and camera. Tap to open the tab.
yua: K'a'ajsajil: %1$s láayli' táan u meyajtik a micrófonoo' yéetel a cámarao'. Pulse uti'al u je'ebel le ju'unil tu'ux yaan.

source: Reminder: %1$s is still using your microphone. Tap to open the tab.
yua: K'a'ajsajil: %1$s láayli' táan u meyajtik a micrófonoo'. Pulse uti'al u je'ebel le ju'unil tu'ux yaan.

source: Remove
yua: Tuupuk

source: Report
yua: Reporrte

source: Restart %1$s
yua: Ka'a chúunuj %1$s

source: Restart extensions
yua: Ka'a káajsik le extensiones

source: Resume
yua: Tsaay

source: Return to previous app
yua: Suut ti' le ka'anatako'ob máaniko'

source: Reviews: %1$s
yua: Reseñas: %1$s

source: Run in private browsing
yua: Ejecutar ti' navegación privada

source: Sans Serif font
yua: Fuente Sans Serif

source: Save
yua: Táabsaj

source: Save file to device
yua: Ooks archivo ti' nu'ukulil

source: Save image
yua: Ta'akikubáa wíimbala'

source: Save password?
yua: Wáaj a ta'akikubáa a contraseña?

source: Search
yua: Kaxta’ak

source: Search %1$s
yua: Kaxant ichil %1$s

source: Search logins
yua: Kaxant logins

source: Search the web
yua: Kaxant te' web

source: Secure Connection Failed
yua: Ma' béeyak u conexión segura

source: Secure Site Not Available
yua: Le ts'ono'oto' ma' yaan

source: See details
yua: Ilawil u tsoolil

source: Sepia color scheme
yua: Esquema u boonil le sequía

source: Serif font
yua: Fuente Serif

source: Set
yua: Jets'kúun

source: Settings
yua: Máak’anbil

source: Share
yua: Ts'aiko'on

source: Share email address
yua: Ts'aiko'on u dirección correo electrónico

source: Share image
yua: Ts'aiko'on wíimbala'

source: Share link
yua: Ts'aiko'on enlace

source: Show all sites
yua: We'esik tuláakal le kúuchilo'obo'

source: Show fewer sites
yua: We'esik menos kúuchilo'ob

source: Sign in
yua: Máaxech

source: Site information
yua: A'almaj t'aan yo'osal le ts'ono'oto'

source: Some content has been blocked by the autoplay setting
yua: Yaan ba'alo'ob ts'o'ok u k'a'alal tumen le ajuste autoplay

source: Sponsored
yua: Patrocinado

source: Status:
yua: Estaado:

source: Stay
yua: P'áatal

source: Stay in private browsing
yua: P'áaten ti' le navegación privada

source: Store unlimited amount of client-side data
yua: Almacenar jump'éel cantidad ilimitada u datos ti' le tséel le cliente

source: Successfully disabled %1$s
yua: %1$s ts'o'ok u xu'ulul yéetel éxito

source: Successfully enabled %1$s
yua: %1$s ts'o'ok u meyaj ma'alob

source: Successfully installed %1$s
yua: %1$s instalado belil

source: Successfully removed %1$s
yua: %1$s ts'o'ok u tselik ma'alob

source: Successfully uninstalled %1$s
yua: %1$s ts'o'ok u jóok'sa'al ma'alob

source: Successfully updated
yua: Ts'o'ok u túumbenkuunsa'al yéetel éxito

source: Supported add-ons checker
yua: Comprobador u complementos compatibles

source: Switch
yua: K'eex

source: Switch to tab
yua: K'ex ti' le ju'unil tu'ux yaan

source: Tabs
yua: Pestañas

source: Tap to copy the URL for this app
yua: Pulse utia'al u copiar u URL le ka'anatako'ob

source: Tap to open the tab that’s using your camera.
yua: Pulse uti'al u je'ebel le ju'unil tu'ux ku meyaj a cámarao'.

source: Tap to open the tab that’s using your microphone.
yua: Pulse utia'al Je'e le ju'unil tu'ux ku meyajtiko'ob a micrófonoo'.

source: Tap to open the tab that’s using your microphone and camera.
yua: Pulse uti'al u je'ebel le ju'unil tu'ux ku meyaj a micrófonoo' yéetel a cámarao'.

source: The address isn’t valid
yua: Le k’áaba’ ta ts’íibtiko’ ma’ utsi’

source: The connection has timed out
yua: Ts'o'ok u xu'ulul u k'iinil le conexión

source: The connection was interrupted
yua: Le conexión ts'o'ok u je'elel

source: The connection was reset
yua: Le conexión ts'o'ok u ka'a káajsa'al

source: The page at %1$s says:
yua: Le linki abas kaambal yaan %1$s ku ya'alik:

source: The page isn’t redirecting properly
yua: Le linki abas kaambal ma' táan u k'e'exel belil

source: This add-on was migrated from a previous version of %1$s
yua: Le plugin ts'o'ok u migrado ti' jump'éel versión anterior ti' %1$s

source: This extension could not be downloaded because of a connection failure.
yua: Le extensióna' ma' páajchaj u descargarta'al tumen yaan jump'éel falla ti' conexión.

source: This extension could not be installed because it appears to be corrupt.
yua: Le extensióna' ma' páajchaj u ts'a'abal tumen ku chíikpajal bey k'aas.

source: This extension could not be installed because it has not been verified.
yua: Le extensióna' ma' páajchaj u ts'a'abal tumen ma' ts'o'ok u yila'al.

source: This extension is blocked for violating Mozilla’s policies and has been disabled.
yua: Le extensión je'ela' táan bloqueada tumen violar le políticas Mozilla yéetel ts'o'ok u desactivado.

source: This extension is restricted for violating Mozilla’s policies and has been disabled. You can enable it, but this may be risky.
yua: Le extensióna' yaan restringida tumen u violar le políticas Mozilla yéetel ts'o'ok u desactivado. Je'el u páajtal u t'abik, ba'ale' je'el u páajtal u yantal riesgo.

source: This extension violates Mozilla’s policies and has been disabled. You can enable it, but this may be risky.
yua: Le extensióna' ku bin tu contra le políticas Mozilla yéetel ts'o'ok u desactivado. Je'el u páajtal u t'abik, ba'ale' je'el u páajtal u yantal riesgo.

source: This extension violates Mozilla’s policies. Using it may be risky.
yua: Le extensióna' ku bin tu contra le políticas Mozilla. U búukinta'al je'el u páajtal u yantal riesgo.

source: This website requires a secure connection.
yua: Le ts'ono'oto' web k'a'abet jump'éel conexión segura.

source: Tracking Protection has blocked trackers
yua: Le protección ti' le seguimiento ts'o'ok u bloqueado le rastreadores

source: Tracking Protection is off for this site
yua: Le protección ti' le seguimiento táan desactivada utia'al le ts'ono'oto'

source: Tracking Protection is on
yua: Le protección ti' le seguimiento táan activada

source: Translation not found, for locale %1$s neither default language %2$s
yua: Ma' tu yilaj le traducción utia'al u localización %1$s ni utia'al le idioma predeterminado %2$s

source: Try Again
yua: Ka'a k'aax

source: Try connecting on a different device. Check your modem or router. Disconnect and reconnect to Wi-Fi.
yua: K'aax u conectar ti' jump'éel nu'ukulil jela'an. Ilawil a módem wa a router. Desconecte yéetel k'a' conectar ti' Wi-Fi.

source: <ul> <li>Could the item have been renamed, removed, or relocated?</li> <li>Is there a spelling, capitalization, or other typographical error in the address?</li> <li>Do you have sufficient access permissions to the requested item?</li> </ul>
yua: <ul> <li>Je'el u páajtal u k'e'exel u k'aaba' le ba'alo', u tselik wa u k'e'exel u k'aaba'?</li> <li>Yaan wáaj ba'ax ma' ma'alob ts'íibta'an, mayúsculas wáaj uláak' ba'alo'ob te' direccióno'?</li> <li>Yaan wáaj tech suficiente privilegios muuk' utia'al le elemento k'áata'al?</li> </ul>

source: <ul> <li>It may have been removed, moved, or file permissions may be preventing access.</li> </ul>
yua: <ul> <li>Je'el u páajtal u ts'o'ok u tselik wa u péeksa'al, wa u páajtalil u ts'íibil ju'uno'obe' táan u beetik u ma' u yokol máak.</li> </ul>

source: <ul> <li>Please contact the website owners to inform them of this problem.</li> </ul>
yua: <ul> <li>Béet t'aan yéetel u yuumil le ts'ono'oto' web uti'al a ts'áaik ojéeltbil ti'ob le talamila'.</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.</li> <li>Please contact the website owners to inform them of this problem.</li> </ul>
yua: <ul> <li>Ma' táan u páajtal u ye'esa'al le linki abas kaambal ka k'áat a wile' tumen ma' páajchaj u yila'al u jaajil le datos ts'o'ok a k'amik.</li> <li>Béet t'aan yéetel u yuumil le ts'ono'oto' web uti'al a ts'áaik ojéeltbil ti'ob le talamila'.</li> </ul>

source: <ul> <li>The page you are trying to view cannot be shown because this website requires a secure connection.</li> <li>The issue is most likely with the website, and there is nothing you can do to resolve it.</li> <li>You can notify the website’s administrator about the problem.</li> </ul>
yua: <ul> <li>Ma' tu páajtal u ye'esa'al le linki abas kaambal ka k'áat a wile' tumen le ts'ono'oto' web k'a'abet jump'éel ma'alob conexión.</li> <li>Le talamilo' yaan ti' le ts'ono'oto' web, yéetel mina'an mixba'al je'el u páajtal a beetik uti'al a yutskíintik.</li> <li>Je'el u páajtal a ts'áaik ojéeltbil ti' u administrador le ts'ono'oto' web yóok'ol le talamilo'.</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
yua: <ul> <li>Le ts'ono'oto' je'el u páajtal u temporalmente ma' disponible wa jach ocupado. Beet uts a wilik tu ka'atéen ichil wa jayp'éel minutos.</li> <li>Wa ma' tu páajtal a kuuch mix jump'éel linki abas kaambal, ilawil u conexión Wi-Fi wa datos ti' a nu'ukul t'aan.</li> </ul>

source: <ul> <li>This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server.</li> <li>If you have connected to this server successfully in the past, the error may be temporary, and you can try again later.</li> </ul>
yua: <ul> <li>Je'el u páajtal u yantal jump'éel talamil ti' u configuración le servidor, wa je'el u páajtal u yaantal máax táan u yilik u beetik bey le servidor.</li> <li>Wa ka'ache' ts'o'ok a conectar yéetel belal ti' le servidor je'ela', le ba'alo' je'el u páajtal u yantal jump'éel k'iini', bey u ka'a ilawil jump'íit k'iin.</li> </ul>

source: <ul> <li>Web addresses are usually written like <strong>http://www.example.com/</strong></li> <li>Make sure that you’re using forward slashes (i.e. <strong>/</strong>).</li> </ul>
yua: <ul> <li>Le dirección web ku ts'íibta'al beya': <strong>http://www.example.com/</strong></li> <li>Asegurar u táan u utilizando barras tak táanil (e.g. <strong>/</strong>).</li> </ul>

source: Unable to connect
yua: Ma’ u beytal u nuupul

source: Unable to open %1$s
yua: Ma' páajchaj u je'ebel %1$s

source: Unexpected response from server
yua: Núukik ma' páa'ta'an ti' le servidor, yéetel le navegador ma' je'el u páajtal u t'u'uchpachtik

source: Unknown Protocol
yua: Protocolo ma' k'ajóolta'an

source: Unlock %1$s
yua: Je'e %1$s

source: Unsafe File Type
yua: Bin yano'ob archivo ma' seguro

source: Unverified scripts can pose security and privacy risks. Only run scripts from extensions or sources you trust.
yua: Le scripts ma' verificados je'el u páajtal u suponer riesgos ti' seguridad yéetel yojeta'al mixba'al. Chéen ejecutar scripts ti' extensiones wa fuentes ku confiar.

source: Unwanted site issue
yua: Talamil ti' le ts'ono'oto' ma' k'áata'ano'

source: Update
yua: Túumbenkun

source: Update password?
yua: Actualizar contraseña?

source: Updater Information
yua: Actualizar a'alajil t'aan

source: Update username?
yua: Actualizar u k'aaba' usuario?

source: URL copied.
yua: URL copiado.

source: Username
yua: A k’áaba’

source: Verification failed
yua: Ma' béeyak u verificar

source: Version
yua: Bersion

source: Voice search
yua: Kaxant t'aan

source: We‘re currently building support for an initial selection of Recommended Extensions.
yua: Bejla'e' táan k beetik le k'oja'ano'obo' uti'al jump'éel selección inicial ti' extensiones recomendadas.

source: Would you like to leave %s to view this content?
yua: A k'áat wa a p'atik %s uti'al a wilik le ba'ala'?

source: Yes
yua: Jaaj

source: You’ve enabled HTTPS-Only Mode for enhanced security, and a HTTPS version of <em>%1$s</em> is not available.
yua: Ts'o'ok a activar le modo chéen HTTPS uti'al u ma'alo'obtal le seguridad, yéetel jump'éel versión HTTPS ti' <em>%1$s</em> ma' táan disponible.

source: 1. Go to Android Settings
yua: 1. Xeen ti' configuración Android

source: %1$s also uses blocklists provided by Disconnect, Inc. as separate and independent works under the <a href="%2$s">GNU General Public License v3</a>, and available <a href="%3$s">here</a>.
yua: %1$s laili’ ku meyajtik le toolts’ìibil uti’al ma’ meyajtak Disconnect, Inc. Bey tseelpaja’anil meyajilo’ob ku béetal tu juunalo’ob yáanal le <a href="%2$s">Noj Páajtalil ti’ tu láakal ti’ GNU v3</a>, je’el u beytal a kaxtik <a href="%3$s">waye’</a>.

source: %1$s can try to automatically reject cookie requests.
yua: %1$s je'el u páajtal u k'aax u rechazar automáticamente solicitudes cookies.

source: %1$s finished
yua: %1$s ts’óokij

source: %1$s is free and open source software made by Mozilla and other contributors.
yua: %1$s lela’ jun meyajil mina’an u wóojil jeba’antak, béeta’ab men Mozilla yéetel u láak’ muulmeyajilo’ob.

source: %1$s is made available to you under the terms of the <a href="%2$s">Mozilla Public License</a> and other open source licenses.
yua: %1$s ti’an ka ch’áabak yéetel u tsoolt’aanil <a href="%2$s">ku ts’áabal u páajtalil men Mozilla</a> yéetel u láak’ páajtalilo’ob yáanti’ob u wóoj jeba’anil.

source: %1$s isn’t like other browsers
yua: %1$s ma' bey uláak' navegadores

source: %1$s tries to reject cookie requests to dismiss annoying cookie banners. Manage cookie banner preferences in %2$s.
yua: %1$s ku yilik u p'atik u k'áat chi'o'ob le cookie uti'al u p'atik le molestos banners cookies. Manage preferences banner cookies in %2$s.

source: %1$s tries to use an HTTPS connection whenever possible for more security. <a href="%2$s">Learn more</a> <br/><br/> Change this setting in Settings > Privacy &amp; Security > Security.
yua: %1$s ku yilik u meyajtik jump'éel conexión HTTPS ken u páajtal uti'al u yantal asab seguridad. <a href="%2$s">Kaanbal asab</a> <br/><br/> K'ex le configuración ti' Configuración > Yojeta'al mixba'al &amp; Seguridad > Seguridad.

source: %1$s will clear this site’s cookies and refresh the page. Clearing all cookies may sign you out or empty shopping carts.
yua: %1$s yaan u tselik u cookies le ts'ono'oto' yéetel yaan u túumbenkuunsik le linki abas kaambal. Wa ka tselik tuláakal le cookies je'el u páajtal u jóok'ol wa u vaciar le carritos maano'.

source: %1$s will send what you type in the address bar to your search engine
yua: %1$s yaan u túuxtik ti' a motor xookilo' ba'ax ka ts'íibtik te' barra de direcciones

source: 2. Tap <b>Permissions</b>
yua: 2. Pulse ti' <b>Permisos</b>

source: 3. Toggle <b>%1$s</b> to ON
yua: 3. K'ex <b>%1$s</b> ti' ON

source: About
yua: Yo'sal

source: About %1$s
yua: Yóok’sal le %1$s

source: About %1$s, help
yua: Yóok’sal le %1$s, áantaj

source: Active
yua: Aktivóo

source: Add and manage custom autocomplete URLs.
yua: Ts’áabak bey xan kaxáantak le chuupuk tu juunal le URL tsikbe’enilta’ab.

source: + Add another search engine
yua: + Tsàabak u láak’ u múuk’il ti’ u kaxan ba’al máak ich web

source: Add another search engine
yua: Ts'áa uláak' motor xookilo'

source: + Add custom URL
yua: + Ts’áabak URL tsikbe’eniltal

source: Add custom URL
yua: Ts’áabak URL tsikbe’eniltal

source: Added to shortcuts!
yua: Ts'a'ab ti' le atajos!

source: Additional source code for %1$s is available under various other free and open source <a href="%2$s">licenses</a>.
yua: U láak’ <a href="%2$s">páajtalilo’ob</a> ti’ wóoj jeba’antak bey xan xma’ boolbi’ laili’ yáanti’ob u láak’ sayab wóoj uti’al %1$s.

source: Add link to autocomplete
yua: Ts'áa enlace uti'al u autocompletar

source: Add search engine
yua: Tsàabak u múuk’il ti’ u kaxan ba’al máak ich web

source: Add shortcuts to your home screen
yua: Ts’a’a u séeb k’at bejilo’ob ti’ a wokoj te’ yáax cha’anila’

source: Add to Home screen
yua: Ts'áabak tu'ux u yila'al tun káajal

source: Add to Shortcuts
yua: Ts'áa ti' le atajos

source: Add URL
yua: Ts'áa URL

source: Add widget to home screen
yua: Ts'áa widget ti' le pantalla Chúunul

source: Advanced
yua: Táanilankil

source: Advertising
yua: Puublisidaad

source: Allow audio and video
yua: Cha' u yu'uba'al yéetel video

source: Allowed
yua: Tu cha'aj

source: Analytics
yua: Analíticas

source: An installed search engine is already using that name.
yua: Junp’éel le u múuk’il ti’ u kaxan ba’al máak ich webe’ ts’óok u k’áabatal beyo’.

source: As a private browser, we never save and cannot restore this tab.
yua: Bey junp'éel maan ich web chen teeche', mixbik'íin táabsiko'on ba'al, beyo' mun beytal k-suutik le nu'ukbesajila'.

source: Ask to allow
yua: K'áatik u cha'abal

source: Autocomplete URLs for sites you use most Long-press any URL in the address bar
yua: Autocompletar URLs uti'al le lu'umo'ob ku meyajtiko'ob asab Pulse chowak je'el ba'ax URL ti' le barra direcciones

source: Automatically attempts to connect to sites using the HTTPS encryption protocol for increased security.
yua: Automáticamente intenta conectar u ti' le lu'umo'oba' utilizando le protocolo cifrado HTTPS utia'al u asab seguridad.

source: Automatic private browsing. Browse. Erase. Repeat.
yua: Ku maan tu juunaj chen a wóok'sal. Maanen. Púustej. Tu ka'aten.

source: Block 3rd-party cookies only
yua: Ma’ meyajta’ak chen cookies ti’ yaanalilo’ob

source: Block 3rd-party tracker cookies only
yua: Chéen bloquear le cookies u rastreador u 3rd-party

source: Block ad trackers
yua: Ma’ meyajta’ab le kaxan ba’al uti’al koonol ba’alob

source: Block analytic trackers
yua: Ma’ meyajta’al le kaxan ba’al túukulnaj

source: Block audio and video
yua: Bloquear audio yéetel video

source: Block audio only
yua: Chéen bloquear audio

source: Block cookies
yua: Ma’ meyajta’ak cookies

source: Block Cookies
yua: Ma’ meyajta’ak cookies

source: Block cross-site cookies
yua: Bloquear le cookies ichil ts'ono'oto'ob

source: Blocked
yua: K'áatik u cha'abal
